nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
	// 2. 下传命令 
u8  A_Flag_Dn_DrvInfo_82H          ;//0x82    17    //  设置车辆信息
u8  A_Flag_Dn_SetupDate_83H        ;//0x83    18    //  设置初装日期
u8  A_Flag_Dn_Satus_84H            ;//0x84    19    //  设置状态量信息
u8  A_Flag_Dn_RTC_C2H              ;//0xC2    20    //  设置记录仪时间
u8  A_Flag_Dn_Plus_C3H             ;//0xC3    21    //  设置速度脉冲系数    
}A_AckFlag;

typedef struct _GPRMC_PRO
{
  void (*Time)(u8 *tmpinfo, u8 hour, u8 min , u8 sec);       
  void (*Status)(u8 *tmpinfo);     
  void (*Latitude)(u8 *tmpinfo);
  void (*Latitude_NS)(u8 *tmpinfo);  // S 南纬  N  北纬
  void (*Longitude)(u8 *tmpinfo);
  void (*Longitude_WE)(u8 *tmpinfo); // E 东经  W  西经
  void (*Speed)(u8 *tmpinfo,u8 Invalue,u8 Point);
  void (*Direction)(u8 *tmpinfo,u8 Invalue,u8 Point);
  void (*Date)(u8 *tmpinfo,u8 fDateModify, u8 hour, u8 min , u8 sec); 

}GPRMC_PRO; 

typedef struct _Position
{
  u8  latitude_BgEnd[4];
  u8  longitude_BgEnd[4];
}POSIT;


typedef struct _TCP_ACKFlag
{
u8  f_CentreCMDack_0001H;
u8  f_CentreCMDack_resualt;
u8  f_CurrentPosition_0201H;  
u8  f_CurrentEventACK_0301H; //  事件报告
u8  f_MsgBroadCast_0303H;//  信息点播/ 取消
u8  f_MediaIndexACK_0802H; //  多媒体应答      0  idle  1  查询图片   2  查询音频  3 查询视频
u8  f_QueryEventCode;  //  0  平台下发命令   1 定时动作   2  抢劫报警触发 3  碰撞触发   
u8  f_SettingPram_0104H;
u8  f_DriverInfoSD_0702H; //   驾驶员 身份信息采集上报
u8  f_Worklist_SD_0701H; //   电子运单上传 
     //  -----  北斗扩展----
u8  f_BD_Extend_7F02H; // 北斗信息查询应答
u8  f_BD_Extend_7F00H;// 扩展终端上发指令
u8  f_BD_DeviceAttribute_8107; //  中心查找终端属性
u8  f_BD_BatchTrans_0704H;   //  定位数据批量上传
u8  f_BD_CentreTakeAck_0805H; // 中心拍照命令应答 
u8  f_BD_ISPResualt_0108H;   //    终端升级结果  
}TCP_ACKFlag;
 

typedef struct _NandSVflag
{
 u8  Doubt_SaveFlag;      // 存储事故疑点 
 u8  MintPosit_SaveFlag;  // 存储每分钟位置  
 u8  PowerCut_SaveFlag;   // 存储断电记录
 u8  Log_SaveFlag;        // 存储登录记录
 u8  Setting_SaveFlag;    // 存储参数修改记录  


}NANDSVFlag;

typedef struct _Stdver
{
   u8 stdverStr[14];   //记录仪执行的国标版本
   u8 MdfyID;          // 修改单号 

}STD_VER; 

typedef struct _DriveInfo
{  
       u8 DriveCode[3]; 
	u8 DriverCard_ID[19];  // 驾驶员驾驶证号码 18位
	u8 DriveName[22];	   // 驾驶员 姓名21
	u8 Driver_ID[21];      // 驾驶员身份证号码20 
	u8 Drv_CareerID[41];  // 驾驶员从业资格证40
	u8 Comfirm_agentID[41]; // 发证机构名称 40

        //--------------- BD  add  ----------------------
	 u8  BD_IC_status;  //  IC 卡插入状态
	 u8  BD_IC_inoutTime[6];//  插拔卡时间  YYMMDDHHMMSS
	 u8  BD_IC_rd_res;  //  IC 卡 读取结果
	 u8  BD_DriveName_Len;// 驾驶员姓名长度
	 u8  BD_DriveName[22];	   // 驾驶员 姓名21
	 u8  BD_Drv_CareerID[21];  // 驾驶员从业资格证20
	 u8  BD_Confirm_agentID_Len;// 发证机构名称长度
	 u8  BD_Confirm_agentID[41]; // 发证机构名称 40
	 u8  BD_ExpireDate[4];   //证件有效期


	
}DRV_INFO; 

typedef struct _VechInfo
{
 u8     Vech_VIN[18];        // 车辆VIN号17
 u8     Vech_Num[13];	     // 车牌号12
 u8     Vech_Type[13];       // 车辆类型 12
 u8     Vech_sim[13];//终端手机号
 u16    Dev_ProvinceID;      // 车辆所在省ID    // 默认省ID   12(天津)      GB/T 2260 中规定的6位码中的前 2 位
 u16    Dev_CityID;          // 车辆所在市ID       // 默认省ID   12(天津)      GB/T 2260 中规定的6位码中的后4  位
 u8     Dev_Color;           // 车牌颜色           // JT415    1  蓝 2 黄 3 黑 4 白 9其他
}VechINFO;


//-------- 北斗 扩展  -------------
typedef struct _BD_EXTEND
{
   // 1. ----  车台设置相关 ----
   u32     Termi_Type;    // 终端类型
   u32     Software_Ver; //  软件版本
   u32     GNSS_Attribute;   // BD  模块属性
   u32     GSMmodule_Attribute; // GSM 模块属性
   u32     Device_Attribute;   //  终端属性  

  //  2.  北斗设置
     u8   GNSS_Mode;     //  北斗模块通信模式
     u8   GNSS_Baud;     //  北斗模块 通信波特率  表示
     u32   GNSS_Baud_Value;//   北斗模块数值
     u8     BD_OutputFreq;  // 北斗模块输出更新率设置 
     u32   BD_SampleFrea; //  北斗模块采集 NMEA  数据频率
             //-----  2013 BD add -------------
     u8     BD_OriginalDataTransMode;     //  GNSS 模块详细定位信息上传方式
     u8     BD_OriginalDataTransSettings; //  GNSS 模块详细数据上传设置01: 单位为秒  02 : 单位为米 03: 单位为秒
     	 

  // 3.  CAN   相关设置
     u32   CAN_1_Mode;    //  CAN  模式  01:还回模式  10  : 普通模式   11:  静默模式  
     u32   CAN_1_ID;
     u8    CAN_1_Type;	
     u8    CAN_1_SampleDuration;  //  单位秒
     u8    CAN_1_TransDuration;  //  单位 秒
		 
     u32   CAN_2_Mode;   //   CAN  模式
     u32   CAN_2_ID;
     u8     CAN_2_Type;    	 
     u8     CAN_2_SampleDuration;  //  单位秒
     u8     CAN_2_TransDuration;  //  单位 秒 
     u32   Collision_Check;     //  bit 31 : 开启关闭碰撞  b7-b0  碰撞时间门限 b8-b15  碰撞加速度门限

     u8     CloseAllcan;  

  //   位置附加信息
       // 1. 信号强度
       u16  FJ_SignalValue;  //  信号强度   高字节 0 ；低字节  高4为 X2 gprs强度 ，低4位 卫星颗数
      //  2. 自定义状态机模拟量上传  
       u8    FJ_IO_1;
	u8    FJ_IO_2;
	u16  AD_0;  //  2 Byte
	u16  AD_1; //   2 Byte

       u8  Extent_IO_status;  // 新北斗协议 IO 状态


 //    围栏相关判断
       u8    Close_CommunicateFlag;  //  进区域 关闭通信   
       u8    Trans_GNSS_Flag;    //  进区域采集GNSS
  
} BD_EXTEND;

//-------车台注册相关 ------------
typedef struct _DevRegst
{
  u8  Sd_counter; //  使能发送间隔计数器
  u8  Enable_sd;  //  使能发送 注册信息
  u8  DeRegst_sd; //  注销车台 
}DevRegst;

//------- 车台鉴权相关 ----------
typedef struct _DevLOGIN
{
  u8  Operate_enable;  // 使能开始操作鉴权操作   1 :enable  0: idle
  u8  Sd_counter;      // 定时发送计时
  u8  Max_sd_num;   // 最大发送鉴权次数 
  u8  Enable_sd;       // 使能发送鉴权信息
  u8  Dur;  // 发送超时判断
}DevLOGIN;
//------- 超速报警 -------
typedef struct SPDEXP
{
  u8  excd_status;
  u16 current_maxSpd;    //  超速报警下 当前的最大速度
  u32 dur_seconds;       //  超速状态计数器    单位: s
  u8  speed_flag;        //  超速报警触发后先立即上报一包标志位  
  u8  ex_startTime[6];
  u8  ex_endTime[6];     
}SPD_EXP;
//------- 疲劳驾驶门限 ----
typedef struct _TIRED_DOOR
{                                              //  单位:  s
  u32  Door_DrvKeepingSec;       // 连续驾驶时间
  u32  Door_DayAccumlateDrvSec;  // 当天累加驾驶时间
  u32  Door_MinSleepSec;         // 最小休息时间 
  u32  Door_MaxParkingSec;       // 最长停车时间  
  u32  Parking_currentcnt;       // 停车实时计数器 
}TIRED_DOOR;
//-------- 上报间隔相关  ---------
typedef struct _SEND_DUR
{                                       //  单位: s
  u32  Heart_Dur;     //  终端心跳包发送间隔
  u16  Heart_SDCnter; // 心跳包计数器
  u8   Heart_SDFlag;   // 心跳包发送标志位
  //------------------
  u32  TCP_ACK_Dur;   //  TCP 消息应答超时
  u16  TCP_ACK_DurCnter;// TCP 计数器
  u8   TCP_SD_state;    // 发送一包后置1.
  //------------------
  u32  TCP_ReSD_Num;  //  TCP 重传次数
  u16  TCP_ReSD_cnter; // 发送计数器    
  //------------------
  u32  UDP_ACK_Dur;   // UDP消息应答超时
  u32  UDP_ReSD_Num;  // UDP 重传次数 
  
  u32  NoDrvLogin_Dur;  //  驾驶员未登录汇报时间间隔
 // u16  NoLogin_SDcnter;   //  发送计时器
  //------------------	
  u32  Sleep_Dur;     //  休眠时候上报的时间间隔
  //u16  Sleep_SDcnter;   //  发送计数器
  //------------------
  u32  Emegence_Dur;  //  紧急报警时上报的时间间隔 
  //u16  Emegence_SDcnter;
  //------------------
  u32  Default_Dur;   //  缺省时间汇报间隔   
  
  u32  SD_Delta_maxAngle; // 拐点补传角度   < 180

}SEND_DUR;
