nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
// ----------- 定距离上报相关  ---------
typedef struct _SEND_DIST
{                                     //   单位: m
  u32  Defalut_DistDelta; // 缺省定距离上报
  u32  NoDrvLogin_Dist;   // 驾驶员未登录 上博距离
  u32  Sleep_Dist;        // 休眠情况下 上报距离
  u32  Emergen_Dist;      // 紧急报警时 上报距离
} SEND_DIST;

//----------- 上报模式  ---------------
typedef struct _SEND_MODE
{ 
  u8 Send_strategy;  
  u8 DUR_TOTALMODE;     // -----   定时上报方式
  u8 Dur_DefaultMode;  
  u8 Dur_SleepMode;     
  u8 Dur_NologinMode;
  u8 Dur_EmegencMode;

  u8 DIST_TOTALMODE;    // ------   定距上报方式  
  u8 Dist_DefaultMode;
  u8 Dist_NoLoginMode;
  u8 Dist_SleepMode;
  u8 Dist_EmgenceMode;
  
}SEND_MODE;

//------- 实时位置跟踪 ----
typedef struct _REALTIME_LOCK
{
  u8  Lock_state;   //  实时跟踪启动标志位
  u16 Lock_Dur;     //  限定的上报时间间隔
  u32 Lock_KeepDur; //  实时上报持续时间
  u32 Lock_KeepCnter;  
  
}REALTIME_LOCK;

//------- 文本信息 --------
typedef struct _TEXT_INFO
{
  u8  TEXT_FLAG;          //  文本标志
  u8  TEXT_SD_FLAG;       // 发送标志位  
  u8  TEXT_Content[100];  // 文本内容
}TEXT_INFO;

//----- 信息 ----
typedef struct _MSG_TEXT
{
  u8   TEXT_mOld;     //  最新的一条信息  写为1代表是最新的一条信息
  u8   TEXT_TYPE;     //  信息类型   1-8  中第几条
  u8   TEXT_LEN;      //  信息长度    
  u8   TEXT_STR[150]; //  信息内容
}MSG_TEXT;

//-----  提问 ------
typedef struct _CENTER_ASK
{
  u8  ASK_SdFlag; //  标志位           发给 TTS  1  ；   TTS 回来  2
  u16 ASK_floatID; // 提问流水号
  u8  ASK_infolen;// 信息长度  
  u8  ASK_answerID;    // 回复ID
  u8  ASK_info[30];//  信息内容
  u8  ASK_answer[30];  // 候选答案  
  u8  ASK_disp_Enable;// 小屏显示使能
}CENTRE_ASK;


//------- 车辆控制  --------
typedef struct _VEHICLE_CONTROL
{
  u8   Control_Flag;  // 控制 标志
  u16  CMD_FloatID;   // 下发应答的消息流水号
  u8   ACK_SD_Flag;   // 回复发送标志位

}VEHICLE_CONTROL;
//--------- 终端属性---------
typedef struct  _PRODUCT_ATTRIBUTE
{
   u16  _1_DevType; //   终端类型   
   u8   _2_ProducterID[5];// 制造商ID
   u8   _3_Dev_TYPENUM[20];//终端型号
   u8   _4_Dev_ID[7];//终端ID	
   u8   _5_Sim_ICCID[10];//终端SIM卡ICCID	
   u8   _6_HardwareVer_Len;//硬件版本号长度
   u8   _7_HardwareVer[20]; // 硬件版本号
   u8   _8_SoftwareVer_len;// 软件版本号长度
   u8  _9_SoftwareVer[20];//软件版本号
   u8 _10_FirmWareVer_len;// 固件版本号长度
   u8 _11_FirmWare[20];// 固件版本号
   u8 _12_GNSSAttribute; // 定位模块属性
   u8 _13_ComModuleAttribute;// 通信模块属性
}PRODUCT_ATTRIBUTE;

//--------  行车记录仪相关  -----
typedef struct  _RECODER
{
  u16  Float_ID;     //  命令流水号
  u8   CMD;     //  数据采集 
  u8   SD_Data_Flag; //  发送返回数返回标志
  u8   CountStep;  //  发送数据需要一步一步发送 
  u32   timer;
  //--------- add on  5-4 
  u8   Devide_Flag;//  需要分包上传标志位
  u16  Total_pkt_num;   // 分包总包数
  u16  Current_pkt_num; // 当前发送包数 从 1  开始
  u8	fcs;
  u8  Error;//    0 idle   1:   采集错误   2:  设置错误
  
}RECODER;
//------  Camera  --------
typedef struct _CAMERA
{
   u8 Channel_ID;     //  拍照通道
   u8 Operate_state;  //  拍照后处理状态    0 : 保存   1:  实时上传
   
}CAMERA;
//---------- 多媒体  ----------
typedef struct _MULTIMEDIA
{
  u32  Media_ID;           //   多媒体数据ID
  u8   Media_Type;         //   0:   图像    1 : 音频    2:  视频 
  u8   Media_CodeType;     //   编码格式  0 : JPEG  1:TIF  2:MP3  3:WAV  4: WMV
  u8   Event_Code;         //   事件编码  0: 平台下发指令  1: 定时动作  2 : 抢劫报警触发 3: 碰撞侧翻报警触发 其他保留
  u8   Media_Channel;      //   通道ID
  //----------------------
  u8   SD_Eventstate;          // 发送事件信息上传状态    0 表示空闲   1  表示处于发送状态        
  u8   SD_media_Flag;     // 发送没提事件信息标志位
  u8   SD_Data_Flag;      // 发送数据标志位
  u8   SD_timer;          // 发送定时器
  u8   MaxSd_counter;   // 最大发送次数  
  u8   Media_transmittingFlag;  // 多媒体传输数据状态  1: 多媒体传输前发送1包定位信息    2 :多媒体数据传输中  0:  未进行多媒体数据传输
  u16  Media_totalPacketNum;    // 多媒体总包数 
  u16  Media_currentPacketNum;  // 多媒体当前报数 
  //----------------------
  u8   RSD_State;     //  重传状态   0 : 重传没有启用   1 :  重传开始    2  : 表示顺序传完但是还没收到中心的重传命令
  u8   RSD_Timer;     //  传状态下的计数器   
  u8   RSD_Reader;    //  重传计数器当前数值 
  u8   RSD_total;     //  重传选项数目  
  
   
  u16  Media_ReSdList[100]; //  多媒体重传消息列表 
}MULTIMEDIA;   
//------  Voice Record 录音相关 ----
typedef struct _VOICE_RECODE
{
   u8   Operate_CMD; //  操作命令  0: 停止录音    1: 开始录音 
   u16  Voice_Dur;   //  录音时间， 0 表示一直录
   u8   Save_Flag;   //  0:  实时上传   1  保存
   u8   SampleRate;  //  音频采样率   0:8K   1: 11k  2:23k  3: 32K  , 其他保留
   
}VOICE_RECODE;

//----------   DataTrans  数据透传  -----------
typedef struct _DATATRANS
{
  u32 TYPE;             // 透传消息类型
  u8 Data_RxLen;       // 接收信息长度
  u8 Data_TxLen;       // 发送信息长度 
  u8 DataRx[10];      // 透传信息内容接收
  u8 Data_Tx[20];     // 透传信息内容发送  
  u8 Tx_Wr;  
  
}DATATRANS;   
//------  进出区域报警 -------------------
typedef struct _INOUT
{
  u8  TYPE; //   1 圆形区域 2 矩形区域 3 多边形区域 4 路线
  u32 ID;   //    区域路线ID
  u8  InOutState; //  0 进  1  出   
  u8  Keep_state;      // 0: idle    1: in   2:  out
}INOUT;
//-------  多媒体索引 -------------------
typedef struct _MEDIA_INDEX
{
  u8  Effective_Flag; // 存储数目
  u32  MediaID;  // 多媒体ID 
  u8  Type;     // 类型    0 图像   1  音频   2  视频
  u8  ID  ;      // 通道
  u8  EventCode; // 事件编码    0  平台下发命令   1 定时动作   2  抢劫报警触发 3  碰撞触发
  u8  FileName[12];  // 文件名
  u8  PosInfo[28];//位置信息  

}MEDIA_INDEX;
//----------- 车门开关拍照相关 ------------
typedef struct _DoorCamra
{  
  u8	  currentState;  // 当前状态 	
  u8	  BakState;   // 存储状态
} DOORCamera;

//  ISP_BD add
typedef struct _ISP_BD
{
   u8     ISP_running;//  远程下载进行中
   u16   Total_PacketNum;//  总包数
   u16   CurrentPacket_Num;//  当前报数
   u32   PacketRX_wr;//  接收数据累加长度
   u8     Update_Type;  // 终端数据类型
   u8  ProductID[5];// 制造商编号
   u8  Version_len; // 版本号长度
   u8  VersionStr[20];//  版本号
   u32  Content_len;// 升级包长度
   u8   ContentData[1024]; // 数据包内容
   u8   ISP_resualt;  //升级结果
}ISP_BD;
typedef struct   TGPSInfo_GPRS
{
   //---------------  河北天地通协议  ---------------------------
    u8		Date[3];	// 年月日(HEX)
	u8		Time[3];	// 十分秒(HEX)
	u8		Latitude[4];    //纬度	  N/S
	u8		Longitude[4];   //经度	 W/E 
} T_GPS_Info_GPRS;  

typedef struct TIRDdrv
{  
  u32	ACC_ONstate_counter;	 //  ACC 开 计数器
  u32	ACC_Offstate_counter;	  //  ACC 关 计数器
  u8    Tireddrv_status;         // 是否在疲劳驾驶状态下    疲劳的情况下为1 ，疲劳触发结束时为2 ，空闲时为0
  u8    Tgvoice_play;            // 使能语音播报提示
  u8    voicePly_timer;          // 语音播报定时器
  u8    voicePly_counter;        // 语音播报次数  ，只播放10次
  u8    start_time[6];           // 疲劳驾驶起始时间
  u8    end_time[6];             // 疲劳驾驶结束时间
  u8    Flag;                    // ACCon =1  ,ACC_off=0; ACC关保持ACCon=1，直到休息过后清 0    
  u8    Status_TiredwhRst;    //  当复位时 疲劳驾驶的状态   0 :停车  1:停车但没触发 2:触发了还没结束                              
  u32   PreWarn_Dur;  //疲劳驾驶预报警
  u32   CurrentDay_DriveTimer_0;         //  上报策略为  0 时 
  u32   CurrentDay_DriveTimer_Driver_1;  // 上报策略为1 时
  u32   CurrentDay_DriveTimer_Driver_2; //  上报策略为1 时
  
