nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
}TID_DRV; 

typedef struct _DetachPKG
{
    u16  Original_floatID;  //  原始消息流水号
    u8    NumOf_Resend;   //  重传包序号
    u16  List_Resend[50];  //重传包ID 列表   

}DETACH_PKG;

typedef struct  _SET_QRY
{
    u8    Num_pram;//   参数个数
    u32  List_pram[90];//  cansh ID   
}SET_QRY;

typedef struct _HUMAN_CONFIRM_WARN
{
   u16 Warn_FloatID;// 报警消息流水号
   u32 ConfirmWarnType; // 人工确认报警类型

}HUMAN_CONFIRM_WARN;

/*
          APP   级别 的应用    
*/

typedef struct  _SYSConfig           //  name:  config
{
    u16     Version_ID ;   //  系统版本IDE
    u8       APN_str[40];  //   接入点名称
    u8       IP_Main[4];   //   主IP 地址 
    u16     Port_main;   //   主socket  端口
    u8       IP_Aux[4];   //   辅IP 地址 
    u16     Port_Aux;    //   辅socket  端口
    u8       DNSR[50];    //  DNSR 1  域名解析
    u8       DNSR_Aux[50]; //   DNSR2   域名解析     
    u16     AccOn_Dur;   //  ACC 开  上报间隔
    u16     AccOff_Dur;  //   ACC 关  上报间隔
    u8      TriggerSDsatus;  //  传感器触发上报状态
    //-------- BD add-----------------
    u8      BD_IC_main_IP[4];  //  IC卡认证主服务器IP 地址
    u32    BD_IC_TCP_port;     //  IC 卡认证主服务器TCP 端口
    u32    BD_IC_UDP_port;    //  IC 卡认证主服务器 UDP 端口
    u8      BD_IC_Aux_IP[4];   //  IC 卡备用服务器IP 地址，端口同主的一样   	
    u8      BD_IC_DNSR[50];    //  DNSR 1  域名解析
    u8      BD_IC_DNSR_Aux[50]; //   DNSR2   域名解析     


	
} SYS_CONF;


typedef struct  _JT808Config   //name:  jt808
{
    SEND_DIST   DISTANCE;	       // 定距离回传相关   16 Bytes
    SEND_DUR    DURATION;		//	发送间隔相关
    SEND_MODE  SD_MODE;         // 信息上报模式    发送方式   
    u8       LOAD_STATE  ;           //选中车辆的负载状态标志   1:空车   2:半空   3:重车
    u8       ConfirmCode[20];       // 鉴权码
    u8       Regsiter_Status;        //  注册状态
    u8       LISTEN_Num[30];       //  监听号码
    u32     Vech_Character_Value;   //  特征系数
    u8      PositionSd_Stratage;    //  位置汇报策略

    u8       FirstSetupDate[6];           //  初次安装时间
    u8       DeviceOnlyID[35];           //   行车记录仪的唯一ID
    u16     Msg_Float_ID;                 //   消息流水号

    u32     Distance_m_u32;            //  行驶记录仪行驶里程  单位: 米
    u32     DayStartDistance_32;     //  每天的起始里程数目

    u32     Speed_warn_MAX;           //  速度报警门限
    u32     Spd_Exd_LimitSeconds;  //  超速报警持续时间门限
    u8       Speed_GetType;             //  记录仪获取速度的方式  00  gps取速度  01 表示从传感器去速度 
    u8       DF_K_adjustState; // 特征系数自动校准状态说明  1:自动校准过    0:尚未自动校准   

   	
    u8       OutGPS_Flag;     //  0  默认  1  接外部有源天线 
    u8       concuss_step;    //------add by  xijing
    u8       password_flag;   //密码输入标志 

    //-----------2013   BD add  -------------------------------------
    u16     BD_CycleRadius_DoorValue;    //  电子围栏半径(非法移动阈值)，单位米
    u16     BD_MaxSpd_preWarnValue;    //  超速报警预警差值，单位 1/10  Km/h
    u16     BD_TiredDrv_preWarnValue;  // 疲劳驾驶预警差值，单位 秒
    u16     BD_Collision_Setting;     // 碰撞参数报警设置    bit 7-bit 0   碰撞时间 单位 4ms   、 bit15-8 碰撞加速度 0.1g  0-79  默认10
    u16     BD_Laydown_Setting;    // 侧翻报警参数设置     侧翻角度 单位 1 度 ，默认30度

    u16     BD_GNSS;

    BD_EXTEND     BD_EXT;  //  北斗相关 CAN GNSS 设置

    //------  摄像头 相关设置 ------------------------------
    u32  BD_CameraTakeByTime_Settings;   // 摄像头定时拍照开关    0 不允许1 允许 表13
    u32  BD_CameraTakeByDistance_Settings;  //  摄像头定距离拍照控制位

    u8    Close_CommunicateFlag;   // 关闭通信标志位	

     //--------  实时上报 ---------  
    REALTIME_LOCK    RT_LOCK;     // 实时跟踪      

      //----------  Standard Version -----------------------
    STD_VER               StdVersion;   // 标准国家版本 
  
    DRV_INFO             Driver_Info;        //  驾驶员信息
	
    VechINFO             Vechicle_Info;     //  车辆信息  
}JT808_CONF;

    //------------- 疲劳驾驶相关----------------

typedef  struct   _TIRED_Config    // name: tired
{
   TID_DRV         Tired_drive; 
   TIRED_DOOR   TiredDoor;  
} TIRED_CONF;

//------ 事件  -------
typedef struct _EVENT               //  name: event
{
  u8 Event_ID;   //  事件ID
  u8 Event_Len;  //  事件长度
  u8 Event_Effective; //  事件是否有效，   1 为要显示  0     
  u8 Event_Str[20];  //  事件内容
}EVENT; 

//----- 信息 ----
typedef struct _MSG_BROADCAST    // name: msg_broadcast
{
  u8   INFO_TYPE;     //  信息类型
  u16  INFO_LEN;      //  信息长度
  u8   INFO_PlyCancel; // 点播/取消标志      0 取消  1  点播
  u8   INFO_SDFlag;    //  发送标志位
  u8   INFO_Effective; //  显示是否有效   1 显示有效    0  显示无效     
  u8   INFO_STR[30];  //  信息内容
}MSG_BRODCAST;


//------ 电话本 -----
typedef struct _PHONE_BOOK            // name: phonebook
{
  u8 CALL_TYPE ;    // 呼入类型  1 呼入 2 呼出 3 呼入/呼出
  u8 NumLen;        // 号码长度   
  u8 UserLen;       // 联系人长度
  u8 Effective_Flag;// 有效标志位   无效 0 ，有效  1
  u8 NumberStr[20]; // 电话号码
  u8 UserStr[10];   // 联系人名称  GBK 编码
}PHONE_BOOK;

//------  圆形围栏  -----------
typedef struct _CIRCLE_RAIL           // name: Rail_cycle
{
  //----------------------- 
  u32  Area_ID;        //  区域ID
  u16  Area_attribute; //  区域属性
  u32  Center_Latitude;//  中心纬度
  u32  Center_Longitude;//  中心经度
  u32  Radius;          //  半径
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
  //------------------------
  u8   Rail_Num;        // 当前围栏数目
  u8   Effective_flag;  // 当前围栏是否 停止    0 : 未启用   1 :  启用  
  u8   StartTimeBCD[6]; //  开始时间
  u8   EndTimeBCD[6];   //  结束时间

}CIRCLE_RAIL;
//------  矩形围栏  -----------
typedef struct _RECT_RAIL                // name:  Rail_rect
{
  //-------------------
  u32  Area_ID;        //  区域ID
  u16  Area_attribute; //  区域属性
  u32  LeftUp_Latitude;//  左上纬度
  u32  LeftUp_Longitude;//  左上经度
  u32  RightDown_Latitude;//  右下纬度
  u32  RightDown_Longitude;//  右下经度     
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
  //------------------  
  u8   Rail_Num;        // 当前围栏数目
  u8   Effective_flag;  // 当前围栏是否 停止    0 : 未启用   1 :  启用  
  u8   StartTimeBCD[6]; //  开始时间
  u8   EndTimeBCD[6];   //  结束时间

}RECT_RAIL;
//------  多边形围栏  --------
typedef struct _POLYGEN_RAIL             //name: Rail_polygen       
{
   //----------------
  u32  Area_ID;        //  区域ID
  u16  Area_attribute; //  区域属性
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
  u16  Acme_Num;        //  顶点数目  至少3个
  u32  Acme1_Latitude; //  顶点1纬度
  u32  Acme1_Longitude;//  顶点1经度
  u32  Acme2_Latitude; //  顶点2纬度
  u32  Acme2_Longitude;//  顶点2经度
  u32  Acme3_Latitude; //  顶点3纬度
  u32  Acme3_Longitude;//  顶点3经度
   //---------------- 
   u8	Rail_Num;		 // 当前围栏数目
   u8	Effective_flag;  // 当前围栏是否 停止	 0 : 未启用   1 :  启用   
   u8	StartTimeBCD[6]; //  开始时间
   u8	EndTimeBCD[6];	 //  结束时间

}POLYGEN_RAIL; 

// -------  路线中拐点  ------
typedef struct _POINT                               //  name:  turn_point      
{
  u32  POINT_ID;        //  区域ID
  u32  Line_ID;        //   路段ID
  u32  POINT_Latitude;//   拐点纬度
  u32  POINT_Longitude;//  拐点经度
  u8   Width;          //  宽度
  u8   Atribute;       //  属性
  u16  TooLongValue;   //  路段行驶过长阈值
  u16  TooLessValue;   //  路段行驶不足阈值	
  u16  MaxSpd;          //  最高速度
  u8   KeepDur;         //  超速持续时间  
}POINT; 
//----------  路线设置  -------
typedef  struct _ROUTE                              // name: route_line
{
 //--------------------------
  u32  Route_ID;        //  线路ID
  u16  Route_attribute; //  线路属性  
  u16  Points_Num;      //  拐点数目  最小3
  u8   Effective_flag;  //  有效状态
  u8   StartTimeBCD[6]; //  开始时间
  u8   EndTimeBCD[6];   //  结束时间
  POINT RoutePoints[3];  //  拐点信息 
 //--------------------------
}ROUTE;

//--------------每分钟的平均速度 
typedef  struct AvrgMintSpeed
{
  u8 datetime[6]; //current
  u8 datetime_Bak[6];//Bak
  u8 avgrspd[60];
  u8 saveFlag;  
}Avrg_MintSpeed;
//----------  事故疑点数据
typedef struct DoubtTYPE
{
  u8  DOUBTspeed;   // 0x00-0xFA  KM/h
  u8  DOUBTstatus;  // status 
} DOUBT_TYPE;



