nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
//-------------------- Media_SD_State 
typedef struct
{
  u8  SD_flag;        // 图片数据发送标志
  u8  photo_sending; //  处于照片发送状态
  u16 SD_packetNum;  //  发送数据的包序号
  u16 Total_packetNum; // 拍照的总包数
  u8  Data_SD_counter; //  数据发送间隔    
  u16  Exeption_timer;   //  异常情况下定时器
  
}_Media_SD_state;


typedef union TIPAddr
{
	u8				ip8[4];	// access the ip as either 4 seperate bytes
	u32				ip32;	// ... or as a single 32-bit dword
} T_IP_Addr;


typedef struct  _GNSS_RAW
{
    u8  WorkEnable;// 使能传输GNSS 原始信息
    u8  first_record;// 首次接收处理
    u8  rd_num;    //读取
    u8  wr_num;    //写入
    u8  save_status;//  bit 0-3     1:表示有数据 0: 表示没有新数据
    u16  Raw_wr;//
    u8    Raw[4][800];//数据存储buffer

   u16 SendDuration;  // 
   u8  SendCounter;  //  0   
   u8  SendFlag;

}GNSS_RAW;


//------- IC 卡相关  ---------------
typedef  struct _IC_MODULE
{
    u16    IC_Wr;// Tx_Wr
    u8     IC_Tx40H[80]; // Tx Buffer  max 64
    u8     IC_TX41H[80];  // 从IC 读取到的驾驶员信息
    u8     IC_TX41H_len; //  驾驶员信息长度 	
    u8     IC_DrvInfoFlag;// 是否获取到驾驶员信息标志   1: 获取到  0:  没有获取到
    u16    IC_Rx_len; // Tx_Rx
    u8     IC_Rx[50]; //  max 25
    u8     Trans_0900Flag;//  发送标志位
    u8     IC_Status;//  IC 卡状态，1:插入    0:  拔出 
}IC_MODULE;


//---------  CAN ---------------------------
typedef struct _CAN_TRAN
{
    //-------  protocol variables
     u32  can1_sample_dur;  // can1 采集间隔  ms
     u32  can1_trans_dur;  // can1  上报间隔 s
     u32  can1_enable_get;  // 使能接收


     u32  can2_sample_dur;  // can2 采集间隔  ms
     u32  can2_trans_dur;  // can2  上报间隔 s
     
     
      u8      canid_1[8];// 原始设置
      u32    canid_1_Filter_ID;  // 接收判断用
      u32    canid_2_NotGetID;  //   不采集ID   
      u8      canid_1_Rxbuf[1024]; // 接收buffer  
      u32    canid_1_ID_RxBUF[128];  // 接收ID  
      u8      canid_1_Sdbuf[1024]; // 发送用buffer 
      u32    canid_1_ID_SdBUF[128];  // 接收ID    
      u16    canid_1_SdWr; // 写buffer下标
      u16    canid_1_RxWr; // 写buffer下标
      u8      canid_1_ext_state; // 扩展帧状态
      u32    canid_1_sample_dur;  //该ID 的采集间隔
      u8      canid_ID_enableGet;//   使能该ID 采集

      //------- system variables  
      u16   canid_timer;  //定时器
      u8     canid_0705_sdFlag;// 发送标志位	  

 }CAN_TRAN;

//-------------- SMS 短信 -------------------
typedef struct _SMS_SD
{
    u8  Msg_sdState;  //   发送短信标志位
    u8  Msg_content[140]; //  短信
    u8  Msg_step;  //  发送步骤，1:  先发号码，2:  等> , 3: 发送1A
    u16 Msg_timer;//  计时器   从发送AT+CMGS 后等待>  ,如果超时则结束短信发送状态
}SMS_SD;

//--------------  串口透传信息 ---------
typedef struct _RAW_DATATRANS
{
   u8    TYPE;  // 类型
   u8    Enable_SD_Flag; // 使能发送标志位 
   u16   datalen;// 数据信息长度
   u8    RawData[300];
}RAW_DATATRANS;


//-------位置字符串 ------
typedef struct _POS_STR
{
   u8  DateTime[20];  //  日期时间字符串  
   u8  Lati_Str[25];  //  纬度字符串
   u8  Longi_Str[25]; //  经度 字符串

}POS_STR;

//---------- POS_STR  ----------------
extern POS_STR   Posit_Str;  //  位置字符串


//---------- RAW_DATATRANS--------
extern RAW_DATATRANS   RawTrans_Com1;
extern RAW_DATATRANS   RawTrans_Com2;   



//---------- SMS SD ------------------
extern  SMS_SD  SMS_send;

//   -------  CAN BD new  --------------
extern CAN_TRAN     CAN_trans;


//------- 北斗扩展协议  ------------
extern GNSS_RAW     GNSS_rawdata; //  GNSS 详细数据上报
extern BD_EXTEND     BD_EXT;     //  北斗扩展协议
extern DETACH_PKG   Detach_PKG; // 分包重传相关
extern SET_QRY         Setting_Qry; //  终端参数查询
extern PRODUCT_ATTRIBUTE   ProductAttribute;// 终端属性
extern HUMAN_CONFIRM_WARN   HumanConfirmWarn;// 人工确认报警

//===============================================================================================
extern _Media_SD_state Photo_sdState;   //  图片发送状态
extern _Media_SD_state Sound_sdState;	//声音发送  
extern _Media_SD_state Video_sdState;	//视频发送
//------ Photo -----
extern  u32 PicFileSize; // 图片文件大小  
extern  u8  PictureName[40];       





//------  video  --------
extern  u8   line_warn_enable;     // 使能路线报警    





//-------  行车记录仪相关extern BD_EXTEND     BD_EXT;     //  北斗扩展协议

extern Avrg_MintSpeed  Avrgspd_Mint; 
extern u32         PerMinSpdTotal; //记录每分钟速度总数  
extern u8          avgspd_Mint_Wr;       // 填写每分钟平均速度记录下标
extern u8          avgspd_Sec_Wr;       // 填写每秒钟平均速度记录下标
extern u8          avgWriteOver;   // 写溢出标志位
extern u8          AspdCounter;    // 每分钟速度有效报数计数器 
extern  u8         Vehicle_sensor; // 车辆传感器状态   0.2s  查询一次  
extern  u8		   Vehicle_sensor_BAK; // 车辆传感器状态	0.2s  查询一次	

extern  DOUBT_TYPE        Sensor_buf[100];// 20s 状态记录   
extern 	u8		   save_sensorCounter,sensor_writeOverFlag;  
extern u16  Delta_1s_Plus;
extern 	u32 	   total_plus; 

//---------- -----------------------------
extern  ISP_BD  BD_ISP; //  BD   升级包  
extern  IC_MODULE   IC_MOD;  //IC 模块

extern u8 TextInforCounter;//文本信息条数
extern DOORCamera   DoorOpen;    //  开关车门拍照
extern MEDIA_INDEX  MediaIndex;  // 多媒体信息
extern INOUT        InOut_Object;  // 进出围栏状态 
extern DATATRANS    DataTrans;     // 数据信息透传
extern MULTIMEDIA   MediaObj;      // 多媒体信息 
extern VOICE_RECODE VoiceRec_Obj;   //  录音功能  
extern CAMERA       Camera_Obj;     //  中心拍照相关
extern RECODER      Recode_Obj;     // 行车记录仪
extern POINT        POINT_Obj;      // 路线的拐点
extern ROUTE        ROUTE_Obj;      // 路线相关
extern POLYGEN_RAIL Rail_Polygen;   // 多边形围栏
extern RECT_RAIL    Rail_Rectangle; // 矩形围栏
extern CIRCLE_RAIL  Rail_Cycle;  // 圆形围栏
extern VEHICLE_CONTROL Vech_Control; //  车辆控制
extern PHONE_BOOK    PhoneBook;  //  电话本
extern PHONE_BOOK	 PhoneBook_8[20];
extern MSG_BRODCAST  MSG_BroadCast_Obj;    // 信息点播  
extern MSG_BRODCAST   MSG_Obj_8[8];  // 信息点播  
extern CENTRE_ASK     ASK_Centre;  // 中心提问
extern EVENT          EventObj;    // 事件
extern EVENT          EventObj_8[8]; // 事件  
//-------文本信息-------
extern MSG_TEXT       TEXT_Obj;
extern MSG_TEXT       TEXT_Obj_8[8],TEXT_Obj_8bak[8];

extern TEXT_INFO      TextInfo;    // 文本信息下发

extern SPD_EXP    speed_Exd;      // 超速报警
extern DevRegst   DEV_regist;  // 注册
extern DevLOGIN   DEV_Login;   //  鉴权


extern NANDSVFlag   NandsaveFlg;
extern A_AckFlag    Adata_ACKflag;
extern TCP_ACKFlag  SD_ACKflag;  


