nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
extern u32         SubCMD_8103H;            //  02 H命令 设置记录仪安装参数回复 子命令 
extern u32         SubCMD_FF01H;            //  FF02 北斗信息扩展
extern u32         SubCMD_FF03H;     //  FF03  设置扩展终端参数设置1

extern u8          SubCMD_10H;            //  10H   设置记录仪定位告警参数
extern u8	       OutGPS_Flag; // 0  默认  1  接外部有源天线
extern u8	       Spd_senor_Null;  // 手动传感器速度为0
extern u32         Centre_DoubtRead;     //  中心读取事故疑点数据的读字段
extern u32         Centre_DoubtTotal;    //  中心读取事故疑点的总字段  


extern u8 		   FCS_GPS_UDP;						//UDP 数据异或和
extern u8          FCS_RX_UDP;                       // UDP 数据接收校验 
extern u8          Centre_IP_modify;            //  中修改IP了 
extern u8          IP_change_counter;           //   中心修改IP 计数器
extern u8		   Down_Elec_Flag;				 //   断油断电使能标志位 


extern ALIGN(RT_ALIGN_SIZE) u8          GPRS_info[3000];  
extern u16         GPRS_infoWr_Tx;


extern u8  Buf_700H_buffer[700]; 
//------ phone
extern u8       CallState; // 通话状态


extern  GPRMC_PRO GPRMC_Funs;


//--------  GPS prototcol------------------------------------------------------------------------------------------------
extern u8   UDP_dataPacket_flag;			   /*V	   0X03 	 ;		   A	  0X02*/
extern u8   DispContent;   // 发送时是否显示数据内容  
extern u8  Camera_Number;



extern u8	GPS_getfirst; 		 //  首次有经纬度 
extern u8	HDOP_value;		 //  Hdop 数值	  
extern u8   Satelite_num;   // 卫星颗数

extern u8   CurrentTime[3];
extern u8   BakTime[3];
extern u8   Sdgps_Time[3];  // GPS 发送 时间记录  


extern  ALIGN(RT_ALIGN_SIZE) u8  UDP_HEX_Rx[1024];    // EM310 接收内容hex     
extern u16 UDP_hexRx_len;    // hex 内容 长度
extern u16 UDP_DecodeHex_Len;// UDP接收后808 解码后的数据长度   



extern GPS_RMC  GPRMC;                   // GPMC格式  
//---------- 808 协议 -----------------------------------------------------------------------------------------------
extern 	u16 	        GPS_Hight;			   //	808协议-> 高程	 m 
extern  u16		        Speed_gps;    // 通过GPS计算出来的速度 km/h   
extern 	u16	            GPS_speed;								  //  GPS定位时候的速度 km/h
extern  u16			    GPS_direction;							  //  GPS方向		 单位2度       

//---------- 用GPS校准特征系数相关 ----------------------------
extern u8		Speed_area; // 校验K值范围
extern u16		Speed_cacu; // 通过K值计算出来的速度 
extern u16 	    Spd_adjust_counter; // 确保匀速状态计数器 
extern u16      Former_DeltaPlus[K_adjust_Duration]; // 前几秒的脉冲数 
extern u8       Former_gpsSpd[K_adjust_Duration];// 前几秒的速度        
extern u8		DF_K_adjustState; // 特征系数自动校准状态说明
 //------- 车辆负载状态 ---------------
extern u8      CarLoadState_Flag;//选中车辆状态的标志   1:空车   2:半空   3:重车
 //------- 多媒体信息类型---------------
extern u8  Multimedia_Flag;//需要上传的多媒体信息类型	1:视频	 2:音频   3:图像
extern u8  SpxBuf[SpxBuf_Size];  
extern u16 Spx_Wr,Spx_Rd; 
extern u8	   Duomeiti_sdFlag; 

extern u8      Jia_GPS_spdFlag;  //  假gps spd Flag
extern u16     Speed_gps_jiashi;   //  假时GPS 真速度

//------- 录音开始或者结束---------------
extern u8  Recor_Flag; //  1:录音开始   2:录音结束  


// ---- 拐点 -----
extern u16  Inflexion_Current;      
extern u16  Inflexion_Bak;       
extern u16  Inflexion_chgcnter; //变化计数器
extern u16  InflexLarge_or_Small;	    // 判断curent 和 Bak 大小	0 equql  1 large  2 small
extern u16  InflexDelta_Accumulate;	//	差值累计 


// ----休眠状态  ------------
extern u8   SleepState;  //   0  不休眠ACC on        1  休眠Acc Off     
extern u8	SleepConfigFlag; //  休眠时发送鉴权标志位
extern u16  Sleep_IO_state; //   休眠情况下的IO 状态   

//---- 固定文件大小 --- 
extern u32 mp3_fsize;   
extern u32 wmv_fsize;    
extern u8  mp3_sendstate;
extern u8  wmv_sendstate;



//---------- 河北天地通协议 ------------------------------------------------------------------------------------------	
extern  u8		SIM_code[6];							   // 要发送的IMSI	号码
extern  u8		IMSI_CODE[15];							//SIM 卡的IMSI 号码
extern  u8		Warn_Status[4]; // 报警状态信息
extern 	u8	    Warn_MaskWord[4];	//	报警屏蔽字	  
extern  u8      Text_MaskWord[4];	 
extern  u8      Key_MaskWord[4]; //   关键字屏蔽字    

//  报警屏蔽字    


extern  u8		Car_Status[4];  // 车辆状态信息   
extern T_GPS_Info_GPRS 	 Gps_Gprs;	 
extern T_GPS_Info_GPRS	 Temp_Gps_Gprs;
extern u8	    A_time[6]; // 定位时刻的时间  
// 定位时刻的时间
extern u8       ReadPhotoPageTotal;
extern u8       SendPHPacketFlag; ////收到中心启动接收下一个block时置位

//-------- 紧急报警 --------
extern u8		warn_flag;		  
extern u8		f_Exigent_warning;//0;     //脚动 紧急报警装置 (INT0 PD0)
extern u8		Send_warn_times;     //   设备向中心上报报警次数，最大3 次
extern u32  	    fTimer3s_warncount;


extern POSIT Posit[60];                //  每分钟位置信息存储
extern u8    PosSaveFlag;             //  存储Pos 状态位

extern u8   Vehicle_RunStatus;    //  bit 0: ACC 开 关             1 开  0关
                                  //  bit 1: 通过速度传感器感知    1 表示行驶  0 表示停止   
                                  //  bit 2: 通过gps速度感知       1 表示行驶  0 表示停止  
extern u8   Status_TiredwhRst;    //  当复位时 疲劳驾驶的状态   0 :停车  1:停车但没触发 2:触发了还没结束                              


extern u8    SpxSrcName[13];
extern u32   SrcFileSize,DestFilesize,SrcFile_read; 
extern u32	 SleepCounter;  

extern u16   DebugSpd;	//调试用GPS速度      
extern u8	 MMedia2_Flag;
extern u8     Send_Rdy4ok;
extern u8   gps_log[50]; //gps log 


//==================================================================================================
// 第一部分 :   以下是GPS 解析转换相关函数 
//==================================================================================================

extern void Time_pro(u8 *tmpinfo, u8 hour, u8 min , u8 sec);
extern void Status_pro(u8 *tmpinfo);
extern void Latitude_pro(u8 *tmpinfo);
extern void Lat_NS_pro(u8 *tmpinfo);
extern void Longitude_pro(u8 *tmpinfo);
extern void Long_WE_pro(u8 *tmpinfo);
extern void Speed_pro(u8 *tmpinfo,u8 Invalue,u8 Point);
extern void Direction_pro(u8 *tmpinfo,u8 Invalue,u8 Point);
extern void Date_pro(u8 *tmpinfo,u8 fDateModify, u8 hour, u8 min , u8 sec); 
extern void HDop_pro(u8 *tmpinfo); 
extern void   GPS_Delta_DurPro(void);    //告GPS 触发上报处理函数 

//==================================================================================================
// 第二部分 :   以下是外部传感器状态监测
//==================================================================================================
/*    
     -----------------------------
     2.1   和协议相关的功能函数
     ----------------------------- 
*/
extern void IMSI_Convert_SIMCODE( void );
extern int IP_Str(char *buf, u32 IP);  
extern void strtrim(u8 *s, u8 c);
extern int str2ip(char *buf, u8 *ip);
/*    
     -----------------------------
     2.2 输入管脚状态监测
     ----------------------------- 
*/

