nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
/*    
     -----------------------------
    2.3  控制输出
     ----------------------------- 
*/
extern void  Enable_Relay(void);
extern void  Disable_Relay(void);


/*    
     -----------------------------
    2.4  不同协议状态寄存器变化
     ----------------------------- 
*/

extern void StatusReg_WARN_Enable(void);
extern void StatusReg_WARN_Clear(void);
extern void StatusReg_ACC_ON(void);
extern void StatusReg_ACC_OFF(void);
extern void StatusReg_POWER_CUT(void);
extern void StatusReg_POWER_NORMAL(void);
extern void StatusReg_GPS_A(void);
extern void StatusReg_GPS_V(void);
extern void StatusReg_SPD_WARN(void);
extern void StatusReg_SPD_NORMAL(void);
extern void StatusReg_Relay_Cut(void);
extern void StatusReg_Relay_Normal(void);
extern void StatusReg_Default(void);  
extern void GNSS_RawDataTrans_Init(u8 mode);  // 北斗添加


	





//==================================================================================================
// 第三部分 :   以下是GPRS无线传输相关协议
//==================================================================================================

extern  u8  Do_SendGPSReport_GPRS(void);   
extern void  Save_GPS(void);    
extern u8    Stuff_DevCommmonACK_0001H(void);        
extern u8    Stuff_RegisterPacket_0100H(u8  LinkNum);  
extern u8    Stuff_DeviceDeregister_0101H(void);      
extern u8    Stuff_DeviceHeartPacket_0002H(void);
extern u8    Stuff_DevLogin_0102H(void);      
extern u8    Stuff_Normal_Data_0200H(void); 
extern u8    Stuff_Current_Data_0200H(void);   //  发送即时数据不存储到存储器中 
extern u8    Stuff_Current_Data_0201H(void);   //   位置信息查询回应
extern u8  Stuff_AppMq_Data_0200H(u8 *instr);   
extern u8    Stuff_SettingPram_0104H(u8 in);
extern u8    Stuff_EventACK_0301H(void);   
extern u8    Stuff_ASKACK_0302H(void);    
extern u8	 Stuff_MSGACK_0303H(void);	  
extern u8    Stuff_ControlACK_0500H(void);    //   车辆控制应答
extern u8    Stuff_RecoderACK_0700H( u8 PaketType);  //   行车记录仪数据上传   
extern u8    Stuff_MultiMedia_InfoSD_0800H(void);      
extern u8    Stuff_MultiMedia_Data_0801H(void);    
extern u8    Stuff_MultiMedia_IndexAck_0802H(void);  
extern u8    Stuff_DriverInfoSD_0702H(void);  
extern u8    Stuff_Worklist_0701H(void); 
extern u8    Stuff_DeviceAttribute_BD_0107H(void);
extern u8    Stuff_ISP_Resualt_BD_0108H(void);
extern u8    Stuff_BatchDataTrans_BD_0704H(void);     
extern u8     Stuff_CANDataTrans_BD_0705H(void);
extern u8    Stuff_CentreTakeACK_BD_0805H(void);
extern u8    Stuff_GNSSRawData_0900H(u8*Instr , u16  len);          
extern u8    Stuff_DataTrans_0900_BD_ICinfo(void);
extern u8    Update_HardSoft_Version_Judge(u8 * instr);
extern void  ISP_file_Check(void);


extern void delay_us(u16 j);
extern void delay_ms(u16 j);


#if 0
extern void  Stuff_ISP_ack(void);      // ISP  
extern void  Stuff_ISPinfo_ack(void);      // ISP  
#endif

extern  void  Media_Start_Init( u8  MdType , u8  MdCodeType);
extern  void  Media_Clear_State(void);
extern  void  Media_Timer(void); 
extern  void  Media_RSdMode_Timer(void);
extern  void  Media_Timer_Service(void); 
extern  void  Meida_Trans_Exception(void);
extern  void  TTS_play(u8 * instr);

extern void   Photo_send_start(u16 Numpic);  
extern  void  DataTrans_Init(void);
extern void  TIRED_Drive_Init(void);
extern u8     Sound_send_start(void);

extern void  TCP_RX_Process(u8  LinkNum);  
extern u16    AsciiToGb(u8 *dec,u8 InstrLen,u8 *scr);
extern void  Time2BCD(u8 *dest);     
extern void   local_time(void);  
extern void  CAN_struct_init(void);
extern void  CAN_send_timer(void);

//----------  SMS  Send  Related  --------------
extern void  SMS_send_init(void);
extern void  SMS_send_process(void); 
extern u8     SMS_send_stateQuery(void);
extern void  SMS_send_enable(void);
extern void  SMS_send_end(void);
extern void  SMS_send_Step(u8  step); 
extern void  SMS_Send_timer(void);
//------------------------------------------


extern void SpeedWarnJudge(void);
extern void Process_GPRSIN_DeviceData(u8 *instr, u16  infolen);
extern u8   Send_Device_Data(void);
extern void SpeedSensorProcess(void);   // 通过汽车的速度传感器获得 速度 并计算里程 


extern void  Sleep_Mode_ConfigEnter(void); 
extern void  Sleep_Mode_ConfigExit(void);

//extern u16   WaveFile_EncodeHeader(u32 inFilesize ,u8* DestStr);   
extern void  CycleRail_Judge(u8* LatiStr,u8* LongiStr);
extern void  RectangleRail_Judge(u8* LatiStr,u8* LongiStr);       
extern u8    Save_MediaIndex( u8 type, u8* name, u8 ID,u8 Evencode);  
//extern void  Sound_SaveStart(void);
//extern void  Sound_SaveEnd(void); 
extern void    DoorCameraInit(void);
extern void    MSG_BroadCast_Read(void); 
extern u8      Time_FastJudge(void);   
//extern u8  RecordSerial_output_Str(const char *fmt,...); 
extern void    Tired_Check(void);
extern void  OutPrint_HEX(u8 * Descrip, u8 *instr, u16 inlen );
extern void  DeviceData_Encode_Send(u8 DeviceID,u8 CMD_TYPE,u8 *Srcstr, u16 inlen);

//==================================================================================================
// 第四部分 :   808  相关存储处理  
//==================================================================================================

extern void  JT808_Related_Save_Process(void);
extern void  Save_Status(u8 year,u8 mon,u8 day,u8 hour,u8 min,u8 sec);
extern void  Spd_Exp_Wr(void);
extern void  close_com(void);
extern void  open_com(void);
extern void  Exact_Test_time(void);      
extern u8    Reg_save_gps(u8 *instr); 
extern void  App_mq_Read_Process(void); 
extern  void  RouteLineWarn_judge(u8* LatiStr,u8* LongiStr);   
extern  void  App_mq_NoAck_counter(void);  
extern  u8   App_mq_Resend(void);     // 启动Queue 重发
extern  u8   Sub_stuff_AppointedPram_0106(void);
extern void  StatusReg_SPD_PreWARN(void);
extern void  StatusReg_SPD_PreNORMAL(void);
extern void   StatusReg_Tired_PreWARN(void);
extern void   StatusReg_Tired_PreNORMAL(void);
extern void  Recorder_init(void); 
extern u8    Stuff_RecoderACK_0700H_Error(void);
extern void  RAW_TransInit(void); 
extern u8    Stuff_DataTrans_0900_BD_Serial1(void);
extern u8    Stuff_DataTrans_0900_BD_Serial2(void);
extern  void  warn_msg_sd(void);


extern uint8_t get_08h( uint8_t *pout );
extern uint8_t get_09h( uint8_t *pout );  
extern uint8_t get_10h( uint8_t *pout );  
extern uint8_t get_11h( uint8_t *pout );  
extern uint8_t get_12h( uint8_t *pout );  
extern uint8_t get_13h( uint8_t *pout );  
extern uint8_t get_14h( uint8_t *pout ); 
extern uint8_t get_15h( uint8_t *pout );  






//==================================================================================================
// 第五部分 :   以下是行车记录仪相关协议 即 附录A   
//==================================================================================================









#endif
